# ---------------------------------------------------------------------------------------------- 
# 
# プログラム概要 ： 麻雀AI：MJSakuraモジュール
# バージョン     ： 0.0.1.0.9(暗槓処理実装)
# プログラム名   ： mjs.py
# 処理概要       ： テスト用メッセージ送信
# Ver0.0.1作成日 ： 2024/06/22 20:30:48
# 最終更新日     ： 2024/06/23 10:53:04
# 
# Copyright (c) 2010-2024 TechMileStoraJP, All rights reserved.
# 
# ---------------------------------------------------------------------------------------------- 

import mjsmodule as mjs

# print(get_message("{\"type\":\"hello\",\"protocol\":\"mjsonp\",\"protocol_version\":3}\n"));
res_list=["{\"type\":\"start_game\",\"id\":1,\"names\":[\"ply1\",\"himawari\",\"ply3\",\"ply4\"]}\n"
#    ,"{\"type\":\"start_kyoku\",\"bakaze\":\"E\",\"kyoku\":1,\"honba\":0,\"kyotaku\":0,\"oya\":0,\"dora_marker\":\"7s\",\"tehais\":[[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"1s\",\"2s\",\"3s\",\"4s\",\"5sr\",\"6s\",\"7s\",\"8s\",\"9s,\"1s\",\"1s\",\"9s\",\"9s\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"]]}\n"
    ,"{\"type\":\"start_kyoku\",\"bakaze\":\"E\",\"kyoku\":1,\"honba\":0,\"kyotaku\":0,\"oya\":0,\"dora_marker\":\"7s\",\"tehais\":[[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"1s\",\"2s\",\"3s\",\"4p\",\"5mr\",\"6p\",\"7s\",\"8s\",\"9s,\"5m\",\"5m\",\"9s\",\"9s\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"]]}\n"
    ,"{\"type\":\"tsumo\",\"actor\":1,\"pai\":\"5m\"}\n"

#    ,"{\"type\":\"reach\",\"actor\":1}\n"
#    ,"{\"type\":\"dahai\",\"actor\":1,\"pai\":\"5mr\",\"tsumogiri\":false}\n"

#    ,"{\"type\":\"tsumo\",\"actor\":2,\"pai\":\"?\"}\n"
#    ,"{\"type\":\"dahai\",\"actor\":2,\"pai\":\"5sr\",\"tsumogiri\":false}\n"

#    ,"{\"type\":\"tsumo\",\"actor\":1,\"pai\":\"3p\"}\n"
#    ,"{\"type\":\"reach\",\"actor\":1}\n"
#    ,"{\"type\":\"dahai\",\"actor\":1,\"pai\":\"C\",\"tsumogiri\":false}\n"
#    ,"{\"type\":\"tsumo\",\"actor\":1,\"pai\":\"5sr\"}\n"
    ]

# print(res_list)
for res in res_list:
  print("================")
  print("RES->:")
  print(res)
  snd = mjs.get_message(res)
  print("================")
  print("<-SND:")
  print(snd)
