# ---------------------------------------------------------------------------------------------- 
# 
# プログラム概要 ： 麻雀AI：MJSakuraモジュール
# バージョン     ： 0.0.1.0.11(チーポン処理準備)
# プログラム名   ： mjs.py
# 処理概要       ： テスト用メッセージ送信
# Ver0.0.1作成日 ： 2024/06/22 20:30:48
# 最終更新日     ： 2024/06/29 15:53:39
# 
# Copyright (c) 2010-2024 TechMileStoraJP, All rights reserved.
# 
# ---------------------------------------------------------------------------------------------- 

import mjsmodule as mjs

# print(get_message("{\"type\":\"hello\",\"protocol\":\"mjsonp\",\"protocol_version\":3}\n"));
res_list=["{\"type\":\"start_game\",\"id\":1,\"names\":[\"ply1\",\"himawari\",\"ply3\",\"ply4\"]}\n"
    ,"{\"type\":\"start_kyoku\",\"bakaze\":\"E\",\"kyoku\":1,\"honba\":0,\"kyotaku\":0,\"oya\":0,\"dora_marker\":\"7s\",\"tehais\":[[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"1s\",\"2s\",\"3s\",\"4s\",\"5sr\",\"W\",\"7s\",\"8s\",\"9s,\"F\",\"F\",\"F\",\"N\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"]]}\n"
    ,"{\"type\":\"tsumo\",\"actor\":0,\"pai\":\"?\"}\n"
    ,"{\"type\":\"dahai\",\"actor\":0,\"pai\":\"6s\",\"tsumogiri\":false}\n"
    ,"{\"type\":\"chi\",\"actor\":1,\"target\":0,\"pai\":\"6s\",\"consumed\":[\"4s\",\"5sr\"]}\n"
    ]

#    ,"{\"type\":\"start_kyoku\",\"bakaze\":\"E\",\"kyoku\":1,\"honba\":0,\"kyotaku\":0,\"oya\":0,\"dora_marker\":\"7s\",\"tehais\":[[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"1s\",\"2s\",\"3s\",\"4s\",\"5sr\",\"6s\",\"7s\",\"8s\",\"9s,\"F\",\"F\",\"W\",\"N\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"]]}\n"
#    ,"{\"type\":\"tsumo\",\"actor\":0,\"pai\":\"?\"}\n"
#    ,"{\"type\":\"dahai\",\"actor\":0,\"pai\":\"F\",\"tsumogiri\":false}\n"
#    ,"{\"type\":\"pon\",\"actor\":1,\"target\":0,\"pai\":\"F\",\"consumed\":[\"F\",\"F\"]}\n"

# print(res_list)
for res in res_list:
  print("================")
  print("RES->:")
  print(res)
  snd = mjs.get_message(res)
  print("================")
  print("<-SND:")
  print(snd)
