# ---------------------------------------------------------------------------------------------- 
# 
# プログラム概要 ： 麻雀AI：MJSakuraモジュール
# バージョン     ： 0.0.2.0.9(オリモード結果詳細表示)
# プログラム名   ： mjs.py
# 処理概要       ： テスト用メッセージ送信
# Ver0.0.1作成日 ： 2024/06/22 20:30:48
# 最終更新日     ： 2025/01/17 19:38:24
# 
# Copyright (c) 2010-2025 TechMileStoraJP, All rights reserved.
# 
# ---------------------------------------------------------------------------------------------- 

import mjsmodule as mjs

# print(get_message("{\"type\":\"hello\",\"protocol\":\"mjsonp\",\"protocol_version\":3}\n"));
res_list=["{\"type\":\"start_game\",\"id\":1,\"names\":[\"ply1\",\"himawari\",\"ply3\",\"ply4\"]}\n"
    ,"{\"type\":\"start_kyoku\",\"bakaze\":\"E\",\"kyoku\":1,\"honba\":0,\"kyotaku\":0,\"oya\":0,\"dora_marker\":\"7s\",\"tehais\":[[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"1m\",\"2m\",\"2m\",\"3m\",\"4m\",\"1p\",\"1p\",\"2p\",\"3p,\"4p\",\"5p\",\"5s\",\"6s\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"],[\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\",\"?\"]]}\n"
    ,"{\"type\":\"tsumo\",\"actor\":0,\"pai\":\"?\"}\n"
    ,"{\"type\":\"dahai\",\"actor\":0,\"pai\":\"C\",\"tsumogiri\":false}\n"
    ,"{\"type\":\"tsumo\",\"actor\":1,\"pai\":\"3s\"}\n"
    ]

# メイン処理
for res in res_list:
  print("================")
  print("PY_RES->:")
  print(res)

  snd = mjs.react(res)
  print("================")
  print("<-PY_SND:")
  print(snd)

# 処理ここまで
