/* ---------------------------------------------------------------------------------------------- 
 * 
 * プログラム概要 ： 麻雀AI：MJSakuraモジュール
 * バージョン     ： 0.0.1.0.1(typeごとの送信Mes定義処理の準備)
 * プログラム名   ： mjs
 * ファイル名     ： mjs.c
 * クラス名       ： MJSMjaiClient
 * 処理概要       ： Mjaiクライアント処理クラス
 * Ver0.0.1作成日 ： 2024/06/01 16:03:43
 * 最終更新日     ： 2024/06/08 07:02:10
 * 
 * Copyright (c) 2010-2024 TechMileStoraJP, All rights reserved.
 * 
 * ---------------------------------------------------------------------------------------------- */

#include "mjs.h"

/* ---------------------------------------------------------------------------------------------- */
// メッセージ定義処理
/* ---------------------------------------------------------------------------------------------- */
void get_message_org(char* tmp_res_mes, char* tmp_snd_mes){

	// 変数定義
	struct MJSClient cli;
	const char* res_none = "{\"type\":\"none\"}\n";

	// 受信メッセージの表示
	printf("================\n");
	printf("res_mes = %s", tmp_res_mes);

	// 解析処理：メイン
	set_taku_stat_main(&cli, tmp_res_mes, tmp_snd_mes);

	// 解析結果表示
	printf("================\n");
	for(int tmp_i = 0; tmp_i < cli.wk_str_count; tmp_i++){
		printf("cli.wk_str[%d] = \"%s\"\n", tmp_i, cli.wk_str[tmp_i]);
	}

	// 送信メッセージの表示
	printf("================\n");
	printf("snd_mes = %s", tmp_snd_mes);

}

/* ---------------------------------------------------------------------------------------------- */
// ソース終了
/* ---------------------------------------------------------------------------------------------- */

